#pragma once 

/*
#############################################################################################
# Might and Magic Heroes 7 (1.0.8364.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51 x64
# ========================================================================================= #
# File: MMH7Game_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_INSTANT_COMMAND_MAX_INT_PARAMS                     8
#define CONST_MAX_PRIVILEGES_COUNT                               20
#define CONST_NORMAL_COMMAND_MAX_INT_PARAMS                      15
#define CONST_MP_MAX_PATH_LENGTH                                 25
#define CONST_MP_MAX_EXT_PATH_LENGTH                             100
#define CONST_MP_MAX_TARGET_UNITS                                16
#define CONST_MP_MAX_ARMY_UNITS                                  15

	EFocusCameraZoomValue_ValueDefault                 = 2,
	EFocusCameraZoomValue_ValueCustom                  = 3,
	EFocusCameraZoomValue_MAX                          = 4
};*/

// Enum MMH7Game.H7SeqAct_Quest_NewNode.EH7QuestRewardAttribute
/*enum EH7QuestRewardAttribute
{
	EH7QRT_A_Might                                     = 0,
	EH7QRT_A_Magic                                     = 1,
	EH7QRT_A_Defense                                   = 2,
	EH7QRT_A_Spirit                                    = 3,
	EH7QRT_A_Leadership                                = 4,
	EH7QRT_A_Destiny                                   = 5,
	EH7QRT_A_MAX                                       = 6
};*/

// Enum MMH7Game.H7SeqAct_Quest_NewNode.EH7QuestRewardType
/*enum EH7QuestRewardType
{
	EH7QRT_None                                        = 0,
	EH7QRT_Attribute                                   = 1,
	EH7QRT_Artifact                                    = 2,
	EH7QRT_Creature                                    = 3,
	EH7QRT_Expierence                                  = 4,
	EH7QRT_Resource                                    = 5,
	EH7QRT_MAX                                         = 6
};*/

// Enum MMH7Game.H7SeqAct_QuestObjective.EH7ObjectiveStage
/*enum EH7ObjectiveStage
{
	EH7OS_STAGE                                        = 0,
	EH7OS_STAGE01                                      = 1,
	EH7OS_STAGE02                                      = 2,
	EH7OS_STAGE03                                      = 3,
	EH7OS_STAGE04                                      = 4,
	EH7OS_STAGE05                                      = 5,
	EH7OS_STAGE06                                      = 6,
	EH7OS_STAGE07                                      = 7,
	EH7OS_STAGE08                                      = 8,
	EH7OS_STAGE_MAX                                    = 9
};*/

// Enum MMH7Game.H7SeqCon_DestructibleObjectIs.EDestructibleObjectState
/*enum EDestructibleObjectState
{
	DOS_INTACT                                         = 0,
	DOS_DESTROYED                                      = 1,
	DOS_MAX                                            = 2
};*/

// Enum MMH7Game.H7SeqCon_Event.EEventExecution
/*enum EEventExecution
{
	EE_ONCE                                            = 0,
	EE_MULTIPLE                                        = 1,
	EE_ALWAYS                                          = 2,
	EE_MAX                                             = 3
};*/

// Enum MMH7Game.H7SeqEvent_CombatTrigger.EWhichCombatMap
/*enum EWhichCombatMap
{
	H7_EWC_ANY                                         = 0,
	H7_EWC_SPECIFIC                                    = 1,
	H7_EWC_MAX                                         = 2
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class MMH7Game.H7StructsAndEnumsNative ( Property size: 0 iter: 277) 
// Class name index: 7953 
// 0x0000 (0x0060 - 0x0060)
class UH7StructsAndEnumsNative : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3168 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7AdventureLayerCellProperty ( Property size: 10 iter: 10) 
// Class name index: 7955 
// 0x005C (0x00BC - 0x0060)
class UH7AdventureLayerCellProperty : public UH7LandscapeGameLayerInfoData
{
public:
	struct FString                                     DisplayName;                                      		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FColor                                      GridColor;                                        		// 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              movementCost;                                     		// 0x0074 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DeepWaterThreshold;                               		// 0x0078 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FString >                           mCombatMapList;                                   		// 0x007C (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FString >                           mWetCombatMapList;                                		// 0x008C (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UAkEvent*                                    mPlayAkEvents;                                    		// 0x009C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UAkEvent*                                    mPlayAmbientAkEvents;                             		// 0x00A4 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UAkEvent*                                    mPlayFoWAmbientAkEvents;                          		// 0x00AC (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UAkEvent*                                    mResumeAkEvents;                                  		// 0x00B4 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3170 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7CombatMapGridDecalComponent ( Property size: 5 iter: 7) 
// Class name index: 7957 
// 0x0030 (0x03E0 - 0x03B0)
class UH7CombatMapGridDecalComponent : public UDecalComponent
{
public:
	class AH7EditorCombatGrid*                         mOwnerGrid;                                       		// 0x03B0 (0x0008) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	class UMaterial*                                   mOriginalMaterial;                                		// 0x03B8 (0x0008) [0x0000000000000002]              ( CPF_Const )
	class UMaterialInstanceConstant*                   mDynamicMaterialInstance;                         		// 0x03C0 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	class UTexture2DDynamic*                           mDynamicGridDataTexture;                          		// 0x03C8 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	TArray< unsigned char >                            mDynamicGridDataTexMip;                           		// 0x03D0 (0x0010) [0x0000000000001000]              ( CPF_Native )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3172 ];

		return pClassPointer;
	};

	void ManualReattach ( );
	void UpdateGridDataRendering ( );
};



// Class MMH7Game.H7LandscapeFilteredDecalComponent ( Property size: 2 iter: 2) 
// Class name index: 7959 
// 0x0005 (0x03B5 - 0x03B0)
class UH7LandscapeFilteredDecalComponent : public UDecalComponent
{
public:
	unsigned long                                      mIsLandscapeFilteringActive : 1;                  		// 0x03B0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      mLandscapeToProjectOn;                            		// 0x03B4 (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3174 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7ListingSavegame ( Property size: 0 iter: 6) 
// Class name index: 7961 
// 0x0000 (0x0060 - 0x0060)
class UH7ListingSavegame : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3176 ];

		return pClassPointer;
	};

	struct FString GetSavegameFolderPath ( );
	void Stop ( );
	void Poll ( TArray< struct FH7ListingSavegameDataScene >* outData, int* isPollingOver );
	void Start ( );
};



// Class MMH7Game.H7SavegameController ( Property size: 1 iter: 10) 
// Class name index: 7963 
// 0x00E8 (0x0148 - 0x0060)
class UH7SavegameController : public UObject
{
public:
	struct FH7SavegameData                             mHeaderData;                                      		// 0x0060 (0x00E8) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3178 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7SavegameDataHolder ( Property size: 0 iter: 1) 
// Class name index: 7965 
// 0x0000 (0x0060 - 0x0060)
class UH7SavegameDataHolder : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3180 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7SavegameTask_Base ( Property size: 4 iter: 7) 
// Class name index: 7967 
// 0x000C (0x006C - 0x0060)
class UH7SavegameTask_Base : public UObject
{
public:
	unsigned char                                      mCurrentState;                                    		// 0x0060 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	unsigned char                                      mCurrentSavegameSystem;                           		// 0x0061 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      mIsErrorTriggered : 1;                            		// 0x0064 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	int                                                mTargetSlotIndex;                                 		// 0x0068 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3182 ];

		return pClassPointer;
	};

	int GetTargetSlotIndex ( );
	void UpdateStatus ( );
	unsigned char GetCurrentTaskState ( );
};



// Class MMH7Game.H7SavegameTask_Checking ( Property size: 3 iter: 5) 
// Class name index: 7969 
// 0x0014 (0x0080 - 0x006C)
class UH7SavegameTask_Checking : public UH7SavegameTask_Base
{
public:
	unsigned long                                      mResultIsSlotFilled : 1;                          		// 0x006C (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	struct FPointer                                    mUPlayOverlapOperation;                           		// 0x0070 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    mUPlayGameList;                                   		// 0x0078 (0x0008) [0x0000000000001000]              ( CPF_Native )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3184 ];

		return pClassPointer;
	};

	bool FinishTaskCheckSlot ( int* isSlotFilled );
	void StartTaskCheckSlot ( int SlotIndex );
};



// Class MMH7Game.H7SavegameTask_Delete ( Property size: 2 iter: 4) 
// Class name index: 7971 
// 0x000C (0x0078 - 0x006C)
class UH7SavegameTask_Delete : public UH7SavegameTask_Base
{
public:
	int                                                mCurrentDeleteStep;                               		// 0x006C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FPointer                                    mUPlayOverlapOperation;                           		// 0x0070 (0x0008) [0x0000000000001000]              ( CPF_Native )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3186 ];

		return pClassPointer;
	};

	bool FinishDeleteTask ( );
	void StartDeleteTask ( int SlotIndex );
};



// Class MMH7Game.H7SavegameTask_Loading ( Property size: 6 iter: 9) 
// Class name index: 7973 
// 0x0034 (0x00A0 - 0x006C)
class UH7SavegameTask_Loading : public UH7SavegameTask_Base
{
public:
	TArray< unsigned char >                            mGameDataBuffer;                                  		// 0x006C (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                mCurrentLoadStep;                                 		// 0x007C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FPointer                                    mUPlayOverlapOperation;                           		// 0x0080 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    mUPlayGameList;                                   		// 0x0088 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    mSavegameHandle;                                  		// 0x0090 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    mUPlayByteRead;                                   		// 0x0098 (0x0008) [0x0000000000001000]              ( CPF_Native )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3188 ];

		return pClassPointer;
	};

	bool FinishObjectLoadTask ( class UObject* Obj );
	bool FinishSceneLoadTask ( );
	void StartLoadTask ( int SlotIndex );
};



// Class MMH7Game.H7SavegameTask_Saving ( Property size: 7 iter: 13) 
// Class name index: 7975 
// 0x0040 (0x00AC - 0x006C)
class UH7SavegameTask_Saving : public UH7SavegameTask_Base
{
public:
	TArray< unsigned char >                            mGameDataBuffer;                                  		// 0x006C (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned char                                      mCurrentSlotType;                                 		// 0x007C (0x0001) [0x0000000000002000]              ( CPF_Transient )
	struct FString                                     mTargetName;                                      		// 0x0080 (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                mCurrentSaveStep;                                 		// 0x0090 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FPointer                                    mUPlayOverlapOperation;                           		// 0x0094 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    mUPlayGameList;                                   		// 0x009C (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    mSavegameHandle;                                  		// 0x00A4 (0x0008) [0x0000000000001000]              ( CPF_Native )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3190 ];

		return pClassPointer;
	};

	bool FinishSaveTaskGetSlot ( int* outSlotIndex );
	bool FinishSaveTask ( );
	void StartObjectSaveTaskToAreaSlot ( unsigned char slotType, struct FString SaveGameName, class UObject* Data );
	void StartObjectSaveTask ( int SlotIndex, struct FString SaveGameName, class UObject* Data );
	void StartSceneSaveTaskToAreaSlot ( unsigned char slotType, struct FString SaveGameName, struct FH7SavegameData* saveGameHeaderData );
	void StartSceneSaveTask ( int SlotIndex, struct FString SaveGameName, struct FH7SavegameData* saveGameHeaderData );
};



// Class MMH7Game.H7SavegameTaskSlotManager ( Property size: 1 iter: 2) 
// Class name index: 7977 
// 0x0010 (0x0070 - 0x0060)
class UH7SavegameTaskSlotManager : public UObject
{
public:
	TArray< struct FH7SavegameTask_SlotLocking >       mCurrentlyLockedSlot;                             		// 0x0060 (0x0010) [0x0000000000003000]              ( CPF_Native | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3192 ];

		return pClassPointer;
	};

};



// Class MMH7Game.SaveGameStatePlayerController ( Property size: 20 iter: 52) 
// Class name index: 7979 
// 0x0068 (0x079C - 0x0734)
class ASaveGameStatePlayerController : public AGamePlayerController
{
public:
	class UH7SaveGameHeaderManager*                    mSaveGameHeaderManager;                           		// 0x0734 (0x0008) [0x0000000000000000]              
	class UH7ListingSavegame*                          mSaveGameScanner;                                 		// 0x073C (0x0008) [0x0000000000000000]              
	unsigned long                                      mCanPoll : 1;                                     		// 0x0744 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      mScanningSaves : 1;                               		// 0x0744 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      mSavedThisTick : 1;                               		// 0x0744 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      mLoadedThisTick : 1;                              		// 0x0744 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      mSaveTaskSucceeded : 1;                           		// 0x0744 (0x0004) [0x0000000000002000] [0x00000010] ( CPF_Transient )
	unsigned long                                      mLoadTaskSucceeded : 1;                           		// 0x0744 (0x0004) [0x0000000000002000] [0x00000020] ( CPF_Transient )
	unsigned long                                      mDeleteTaskSucceeded : 1;                         		// 0x0744 (0x0004) [0x0000000000002000] [0x00000040] ( CPF_Transient )
	unsigned long                                      mCheckTaskSucceeded : 1;                          		// 0x0744 (0x0004) [0x0000000000002000] [0x00000080] ( CPF_Transient )
	unsigned long                                      mPreSlotCheck : 1;                                		// 0x0744 (0x0004) [0x0000000000002000] [0x00000100] ( CPF_Transient )
	unsigned long                                      mPostSlotCheck : 1;                               		// 0x0744 (0x0004) [0x0000000000002000] [0x00000200] ( CPF_Transient )
	unsigned long                                      mSlotCheckMP : 1;                                 		// 0x0744 (0x0004) [0x0000000000002000] [0x00000400] ( CPF_Transient )
	unsigned long                                      mWantsQuickLoad : 1;                              		// 0x0744 (0x0004) [0x0000000000000000] [0x00000800] 
	TArray< struct FH7ListingSavegameDataScene >       mSaveGameList;                                    		// 0x0748 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FH7ListingSavegameDataScene >       mScannedSaves;                                    		// 0x0758 (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< class UH7SavegameTask_Base* >              mSaveLoadTasks;                                   		// 0x0768 (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                mSlotCheckStatus;                                 		// 0x0778 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FScriptDelegate                             __mOnDeleteComplete__Delegate;                    		// 0x077C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0780 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __SaveGameSort__Delegate;                         		// 0x078C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x0790 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3194 ];

		return pClassPointer;
	};

	void ExitHeroes ( );
	void eventComputeTick ( );
	void LoadPlayerProfileState ( struct FString Filename );
	void SavePlayerProfileState ( struct FString Filename );
	struct FString ScrubScannerSaveName ( struct FString scannerSaveName );
	struct FString ScrubUserSaveName ( struct FString userSaveName );
	struct FString ScrubFileName ( struct FString Filename );
	class UH7SaveGameHeaderManager* GetSaveGameHeaderManagerForSaveGame ( int SlotIndex );
	bool SaveGameExists ( int SlotIndex );
	int GetIndexOf ( struct FString Filename );
	int SaveGameSort ( struct FH7ListingSavegameDataScene A, struct FH7ListingSavegameDataScene B );
	void SortSaveGameList ( );
	TArray< struct FH7ListingSavegameDataScene > GetSaveGameList ( );
	void DeleteSaveGameInUplay ( int SlotIndex );
	void DeleteSaveGame ( int SlotIndex, struct FScriptDelegate callbackFunction );
	void LoadGameState ( int SlotIdx, struct FString MapName, unsigned long isMultiplayer );
	void CacheSaves ( );
	void ClearSavesCache ( );
	void SaveGameComplete ( int SlotIndex, unsigned char saveType, struct FString userInputName );
	void Savegame ( int SlotIndex, unsigned char saveType, struct FString userInputName );
	int GetSlotIdMP ( int checksum );
	void ProcessScanMP ( );
	void ScanForAllSaveGamesMP ( unsigned long justSlotCheck );
	void StopScan ( );
	void ScanComplete ( );
	void ProcessScan ( );
	void ScanForAllSaveGames ( );
	void eventPostBeginPlay ( );
	class AH7Hud* GetHUD ( );
	class UH7SaveGameHeaderManager* GetSaveGameHeaderManager ( );
	void mOnDeleteComplete ( );
};



// Class MMH7Game.H7ActorFactory ( Property size: 0 iter: 0) 
// Class name index: 7981 
// 0x0000 (0x009C - 0x009C)
class UH7ActorFactory : public UActorFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3196 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7CameraHeightVolume ( Property size: 0 iter: 0) 
// Class name index: 7983 
// 0x0000 (0x027C - 0x027C)
class AH7CameraHeightVolume : public AVolume
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3198 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7CellChangerActor ( Property size: 3 iter: 5) 
// Class name index: 7985 
// 0x001F (0x026C - 0x024D)
class AH7CellChangerActor : public AStaticMeshActor
{
public:
	TArray< class UH7AdventureMapCell* >               mCellsToChange;                                   		// 0x0250 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UParticleSystemComponent*                    mFX;                                              		// 0x0260 (0x0008) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	int                                                mLastCellChange;                                  		// 0x0268 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3200 ];

		return pClassPointer;
	};

	void eventPostSerialize ( );
	void eventProcessCellChange ( unsigned char cellMovementType );
};



// Class MMH7Game.H7EditorCameraHeightTool ( Property size: 4 iter: 5) 
// Class name index: 7987 
// 0x0044 (0x027C - 0x0238)
class UH7EditorCameraHeightTool : public UPrimitiveComponent
{
public:
	class UMaterialInstance*                           Material;                                         		// 0x0238 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FBoxSphereBounds                            ComputedBounds;                                   		// 0x0240 (0x001C) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	TArray< struct FCamHeight_VertexData >             VertexData;                                       		// 0x025C (0x0010) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	TArray< int >                                      IndiceData;                                       		// 0x026C (0x0010) [0x0000000000003000]              ( CPF_Native | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3202 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7EditorCellOverlayComponent ( Property size: 5 iter: 6) 
// Class name index: 7989 
// 0x0048 (0x0280 - 0x0238)
class UH7EditorCellOverlayComponent : public UPrimitiveComponent
{
public:
	class UMaterialInstance*                           Material;                                         		// 0x0238 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              Offset;                                           		// 0x0240 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FBoxSphereBounds                            ComputedBounds;                                   		// 0x0244 (0x001C) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	TArray< struct FCellOverlay_VertexData >           VertexData;                                       		// 0x0260 (0x0010) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	TArray< int >                                      IndiceData;                                       		// 0x0270 (0x0010) [0x0000000000003000]              ( CPF_Native | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3204 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7EditorDummyMapObject ( Property size: 1 iter: 2) 
// Class name index: 7991 
// 0x000B (0x0258 - 0x024D)
class AH7EditorDummyMapObject : public AStaticMeshActor
{
public:
	struct FPointer                                    VfTable_IH7IEditorTerrainScan;                    		// 0x0250 (0x0008) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3206 ];

		return pClassPointer;
	};

	void OnTerrainChange ( class ULandscapeLayerInfoObject* newLayer, class ALandscapeProxy* newLandscape );
};



// Class MMH7Game.H7EditorItemType ( Property size: 1 iter: 1) 
// Class name index: 7993 
// 0x0001 (0x0061 - 0x0060)
class UH7EditorItemType : public UObject
{
public:
	unsigned char                                      mItemTypeProperty;                                		// 0x0060 (0x0001) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3208 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7EditorScanner ( Property size: 3 iter: 7) 
// Class name index: 7995 
// 0x0004 (0x00B8 - 0x00B4)
class UH7EditorScanner : public UBrushBuilder
{
public:
	unsigned long                                      mRecreateLandscapeColliders : 1;                  		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mAllStaticMeshActorToFoliage : 1;                 		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mSelectedStaticMeshActorToFoliage : 1;            		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3210 ];

		return pClassPointer;
	};

	void StaticMeshActorToFoliage ( unsigned long onlySelected );
	void RecreateLandscapeColliders ( );
	void PerformFullScan ( );
	bool eventBuild ( );
};



// Class MMH7Game.H7EditorTools ( Property size: 13 iter: 27) 
// Class name index: 7997 
// 0x000C (0x00C0 - 0x00B4)
class UH7EditorTools : public UBrushBuilder
{
public:
	unsigned long                                      mWeldStaticMeshes : 1;                            		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mLandscapeCropStaticMeshes : 1;                   		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mTransformLandscape : 1;                          		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      mFullTransformLandscape : 1;                      		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      mVertexTransformLandscape : 1;                    		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      mComputeLandscapeMaterials : 1;                   		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      mStaticMeshesInstantiation : 1;                   		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      mConvertToH7InterpActor : 1;                      		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000080] ( CPF_Edit )
	unsigned long                                      mConvertToH7ParticleEmitter : 1;                  		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
	unsigned long                                      mResetArmyMeshes : 1;                             		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000200] ( CPF_Edit )
	unsigned long                                      mSetupDefaultCellLayerData : 1;                   		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000400] ( CPF_Edit )
	unsigned long                                      mClearPathsRebuilt : 1;                           		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000800] ( CPF_Edit )
	class UPrefab*                                     mPrefabToClean;                                   		// 0x00B8 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3212 ];

		return pClassPointer;
	};

	void ClearPathsRebuilt ( );
	void SetupDefaultCellLayerData ( );
	void ResetArmyMeshes ( );
	void CleanupPrefab ( );
	void ConvertParticleEmitters ( );
	void ConvertInterpActors ( );
	void StaticMeshesInstantiation ( );
	void ComputeLandscapeMaterials ( );
	void VertexTransformLandscape ( );
	void FullTransformLandscape ( );
	void TransformLandscape ( );
	void LandscapeCropStaticMeshes ( );
	void WeldStaticMeshes ( );
	bool eventBuild ( );
};



// Class MMH7Game.H7IAdventureMapCellInteractor ( Property size: 0 iter: 2) 
// Class name index: 7999 
// 0x0000 (0x0060 - 0x0060)
class UH7IAdventureMapCellInteractor : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3214 ];

		return pClassPointer;
	};

	void OnArmyUnregister ( class AH7AdventureArmy* Army, class UH7AdventureMapCell* newDestinationCell );
	void OnArmyRegister ( class AH7AdventureArmy* Army );
};



// Class MMH7Game.H7IEditorTerrainScan ( Property size: 0 iter: 1) 
// Class name index: 8001 
// 0x0000 (0x0060 - 0x0060)
class UH7IEditorTerrainScan : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3216 ];

		return pClassPointer;
	};

	void OnTerrainChange ( class ULandscapeLayerInfoObject* newLayer, class ALandscapeProxy* newLandscape );
};



// Class MMH7Game.H7KismetHeroReplacer ( Property size: 4 iter: 6) 
// Class name index: 8003 
// 0x0014 (0x00C8 - 0x00B4)
class UH7KismetHeroReplacer : public UBrushBuilder
{
public:
	unsigned long                                      mRebuild : 1;                                     		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mPreview : 1;                                     		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	class AH7EditorHero*                               mOldHero;                                         		// 0x00B8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class AH7EditorHero*                               mNewHero;                                         		// 0x00C0 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3218 ];

		return pClassPointer;
	};

	bool ReplaceHeroes ( );
	bool eventBuild ( );
};



// Class MMH7Game.H7LandscapeGenerator ( Property size: 29 iter: 34) 
// Class name index: 8005 
// 0x00E0 (0x0194 - 0x00B4)
class UH7LandscapeGenerator : public UBrushBuilder
{
public:
	TArray< struct FLandscapeGeneratorMapSizePreference > MapSizePreferences;                               		// 0x00B4 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FLandscapeGeneratorTypePreference > TypePreferences;                                  		// 0x00C4 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FLandscapeGeneratorTypePreference > TypePreferences_Underground;                      		// 0x00D4 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FVector                                     UndergroundOffset;                                		// 0x00E4 (0x000C) [0x0000000000004000]              ( CPF_Config )
	struct FVector                                     WaterOffset;                                      		// 0x00F0 (0x000C) [0x0000000000004000]              ( CPF_Config )
	struct FVector                                     SkyboxOffset;                                     		// 0x00FC (0x000C) [0x0000000000004000]              ( CPF_Config )
	struct FVector                                     LandscapeDrawscale;                               		// 0x0108 (0x000C) [0x0000000000004000]              ( CPF_Config )
	struct FColor                                      UndergroundLightColor;                            		// 0x0114 (0x0004) [0x0000000000004000]              ( CPF_Config )
	struct FColor                                      UndergroundLightEnvironmentColor;                 		// 0x0118 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              UndergroundLightEnvironmentIntensity;             		// 0x011C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              UndergroundLightBrightness;                       		// 0x0120 (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      UndergroundLightCastShadows : 1;                  		// 0x0124 (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )
	unsigned long                                      mRebuild : 1;                                     		// 0x0124 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mInited : 1;                                      		// 0x0124 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	struct FLinearColor                                UndergroundFogColor;                              		// 0x0128 (0x0010) [0x0000000000004000]              ( CPF_Config )
	float                                              UndergroundFogBrightness;                         		// 0x0138 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              UndergroundFogDensity;                            		// 0x013C (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned char                                      mMapSizePredefined;                               		// 0x0140 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      mLandscapeType;                                   		// 0x0141 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	int                                                mSizeWidth;                                       		// 0x0144 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mSizeHeight;                                      		// 0x0148 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     mLocation;                                        		// 0x014C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class UMaterialInterface*                          LandscapeMaterial;                                		// 0x0158 (0x0008) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	int                                                ComponentSizeQuads;                               		// 0x0160 (0x0004) [0x0000000000000000]              
	int                                                SubsectionSizeQuads;                              		// 0x0164 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                NumSubsections;                                   		// 0x0168 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FName >                             mLayerNames;                                      		// 0x016C (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< class UH7LandscapeGameLayerInfoData* >     mGameData;                                        		// 0x017C (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FName                                       mDefaultLayer;                                    		// 0x018C (0x0008) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3220 ];

		return pClassPointer;
	};

	class ALandscape* ActualCreateLandscape ( );
	void SetDataFromConfig ( );
	bool eventBuild ( );
};



// Class MMH7Game.H7ObjectLayerFilterConfig ( Property size: 1 iter: 2) 
// Class name index: 8007 
// 0x0010 (0x0070 - 0x0060)
class UH7ObjectLayerFilterConfig : public UObject
{
public:
	TArray< struct FObjectLayerFilter >                ObjectLayerFilters;                               		// 0x0060 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3222 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7ObjectLayerFilterConfig_Artifacts ( Property size: 0 iter: 0) 
// Class name index: 8010 
// 0x0000 (0x0070 - 0x0070)
class UH7ObjectLayerFilterConfig_Artifacts : public UH7ObjectLayerFilterConfig
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3224 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7ObjectLayerFilterConfig_Buildings ( Property size: 0 iter: 0) 
// Class name index: 8012 
// 0x0000 (0x0070 - 0x0070)
class UH7ObjectLayerFilterConfig_Buildings : public UH7ObjectLayerFilterConfig
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3226 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7ObjectLayerFilterConfig_Creatures ( Property size: 0 iter: 0) 
// Class name index: 8014 
// 0x0000 (0x0070 - 0x0070)
class UH7ObjectLayerFilterConfig_Creatures : public UH7ObjectLayerFilterConfig
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3228 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7ObjectLayerFilterConfig_Misc ( Property size: 0 iter: 0) 
// Class name index: 8016 
// 0x0000 (0x0070 - 0x0070)
class UH7ObjectLayerFilterConfig_Misc : public UH7ObjectLayerFilterConfig
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3230 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7ObjectLayerFilterConfig_Resources ( Property size: 0 iter: 0) 
// Class name index: 8018 
// 0x0000 (0x0070 - 0x0070)
class UH7ObjectLayerFilterConfig_Resources : public UH7ObjectLayerFilterConfig
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3232 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7ObjectLayerFilterConfig_Towns ( Property size: 0 iter: 0) 
// Class name index: 8020 
// 0x0000 (0x0070 - 0x0070)
class UH7ObjectLayerFilterConfig_Towns : public UH7ObjectLayerFilterConfig
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3234 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7AchievementManager ( Property size: 7 iter: 45) 
// Class name index: 8022 
// 0x001C (0x007C - 0x0060)
class UH7AchievementManager : public UObject
{
public:
	TArray< class UH7UPlayTask* >                      mRunningUPlayTasks;                               		// 0x0060 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UH7PlayerProfile*                            playerProfile;                                    		// 0x0070 (0x0008) [0x0000000000000000]              
	unsigned long                                      mCompletedFirstCampaignMap : 1;                   		// 0x0078 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      mCompletedOneCampaign : 1;                        		// 0x0078 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      mCompletedTwoCampaigns : 1;                       		// 0x0078 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      mCompletedFinalCampaign : 1;                      		// 0x0078 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      mCompletedOneSkirmishGame : 1;                    		// 0x0078 (0x0004) [0x0000000000000000] [0x00000010] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3236 ];

		return pClassPointer;
	};

	void Cheat_UnlockAllRewards ( );
	bool CanRewardBeUsed ( );
	int GetRewardIndexByID ( struct FString nameID );
	void SetStateReward_LM ( unsigned long NewState );
	bool GetStateReward_LM ( );
	void SetStateReward_AP ( unsigned long NewState );
	bool GetStateReward_AP ( );
	void SetStateReward_BH ( unsigned long NewState );
	bool GetStateReward_BH ( );
	void SetStateReward_PM ( unsigned long NewState );
	bool GetStateReward_PM ( );
	void SetStateReward_HD ( unsigned long NewState );
	bool GetStateReward_HD ( );
	void eventBuildRewardMenu ( );
	void PullUPlayRewards ( );
	void ActionCompletedBulk ( TArray< int > actionIDs );
	void ActionCompleted_SAAIDY ( );
	void ActionCompleted_ML ( );
	void ActionCompleted_PYS ( );
	void ActionCompleted_LFTP ( );
	void ActionCompleted_DIH ( );
	void eventActionUnlocked ( struct FString actionID, struct FString actionSID, unsigned long isOffilne, unsigned long showPopup );
	void PullActions ( );
	void HandleMapCompleted ( struct FString MapFilename );
	void eventSaveProfile ( );
	void UpdateStatus ( );
	bool GetCompletedFirstCampaignMap ( );
	void SetCompletedFirstCampaignMap ( );
	bool GetCompletedOneSkirmishMap ( );
	void SetCompletedOneSkirmishMap ( );
	bool GetCompletedFinalCampaign ( );
	void SetCompletedFinalCampaign ( );
	bool GetCompletedTwoCampaigns ( );
	void SetCompletedTwoCampigns ( );
	bool GetCompletedOneCampaign ( );
	void SetCompletedOneCampaign ( );
	class UH7PlayerProfile* GetPlayerProfile ( );
	void SetPlayerProfile ( class UH7PlayerProfile* Profile );
};



// Class MMH7Game.H7AdventureCellMarker ( Property size: 8 iter: 17) 
// Class name index: 8024 
// 0x003C (0x027C - 0x0240)
class AH7AdventureCellMarker : public AH7UnrealObjectCellMarker
{
public:
	struct FPointer                                    VfTable_IH7IQuestTarget;                          		// 0x0240 (0x0008) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	unsigned char                                      mShape;                                           		// 0x0248 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mSkipBlocked : 1;                                 		// 0x024C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	float                                              mEditorVisibilityHeight;                          		// 0x0250 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      mEditorTriggerColor;                              		// 0x0254 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UH7AdventureMapCell* >               mUserPickedCells;                                 		// 0x0258 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UH7AdventureMapCell* >               mMarkedCells;                                     		// 0x0268 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                Mid;                                              		// 0x0278 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3238 ];

		return pClassPointer;
	};

	void eventInitMarker ( );
	class UH7AdventureMapCell* GetCurrentPosition ( );
	void AddQuestFlag ( );
	void ClearQuestFlag ( );
	bool IsMovable ( );
	bool IsHidden ( );
	int GetQuestTargetID ( );
	bool Contains ( class UH7AdventureMapCell* cell );
};



// Class MMH7Game.H7CellFoWMarker ( Property size: 0 iter: 0) 
// Class name index: 8026 
// 0x0000 (0x027C - 0x027C)
class AH7CellFoWMarker : public AH7AdventureCellMarker
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3240 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7CellTriggerArmy ( Property size: 2 iter: 4) 
// Class name index: 8028 
// 0x0018 (0x0294 - 0x027C)
class AH7CellTriggerArmy : public AH7AdventureCellMarker
{
public:
	struct FPointer                                    VfTable_IH7IAdventureMapCellInteractor;           		// 0x027C (0x0008) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	TArray< class AH7AdventureArmy* >                  mRegisteredArmies;                                		// 0x0284 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3242 ];

		return pClassPointer;
	};

	void OnArmyUnregister ( class AH7AdventureArmy* Army, class UH7AdventureMapCell* newDestinationCell );
	void OnArmyRegister ( class AH7AdventureArmy* Army );
};



// Class MMH7Game.H7TileMarker ( Property size: 0 iter: 0) 
// Class name index: 8030 
// 0x0000 (0x027C - 0x027C)
class AH7TileMarker : public AH7AdventureCellMarker
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3244 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7TreasureMarker ( Property size: 0 iter: 0) 
// Class name index: 8032 
// 0x0000 (0x027C - 0x027C)
class AH7TreasureMarker : public AH7TileMarker
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3246 ];

		return pClassPointer;
	};

};



// Class MMH7Game.H7AdventureConfiguration ( Property size: 77 iter: 77) 
// Class name index: 8034 
// 0x02A8 (0x04E8 - 0x0240)
class AH7AdventureConfiguration : public AActor
{
public:
	int                                                mBaseLostHeroCost;                                		// 0x0240 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mPerLevelLostHeroCost;                            		// 0x0244 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mBaseNewHeroCost;                                 		// 0x0248 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mPerNumHeroesNewHeroCost;                         		// 0x024C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mNumHeroesSameFaction;                            		// 0x0250 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mNumHeroesOtherFactions;                          		// 0x0254 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mMaxSkillSlot;                                    		// 0x0258 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mSkillSlot;                                       		// 0x025C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mAbilitySlot;                                     		// 0x0260 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mOptionalAbility : 1;                             		// 0x0264 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mEnableDailyGrowth : 1;                           		// 0x0264 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mQuickCombatAllowSpellCast : 1;                   		// 0x0264 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      mQuickCombatOutputToLog : 1;                      		// 0x0264 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      mQuickCombatIgnoreHeroes : 1;                     		// 0x0264 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	struct FH7RelativeWeightData                       mWeightData;                                      		// 0x0268 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	int                                                mCaravanMaxMovementPoints;                        		// 0x0284 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UParticleSystem*                             mHighlightParticle;                               		// 0x0288 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                mCostPerInformation;                              		// 0x0290 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mManaRegenMultiplier;                             		// 0x0294 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AH7Ship*                                     mShip;                                            		// 0x0298 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                mArcaneKnowledgeTiers[ 0x4 ];                     		// 0x02A0 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mAPRLevels[ 0x6 ];                                		// 0x02B0 (0x0018) [0x0000000000000001]              ( CPF_Edit )
	float                                              mNegotiationBaseChances[ 0x7 ];                   		// 0x02C8 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	float                                              mNegotiationImpressionMods[ 0x7 ];                		// 0x02E4 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     mDefaultStartingWeek;                             		// 0x0300 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FString >                           mWeeks;                                           		// 0x0310 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FString >                           mMonth;                                           		// 0x0320 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                mMaxDayPerWeek;                                   		// 0x0330 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mMaxWeeksPerMonth;                                		// 0x0334 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mMaxMonthPerYear;                                 		// 0x0338 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyPlayerStartResourcesMultiplier[ 0x4 ]; 		// 0x033C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyCritterStartSizeMultiplier[ 0x4 ];     		// 0x034C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyCritterGrowthRateMultiplier[ 0x4 ];    		// 0x035C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyAIStartResourcesMultiplier[ 0x4 ];     		// 0x036C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyAICreatureGrowthRateMultiplier[ 0x4 ]; 		// 0x037C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyAIResourceIncomeMultiplier[ 0x4 ];     		// 0x038C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyAIAggressivenessMultiplier[ 0x4 ];     		// 0x039C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyPlayerStartResourcesMultiplierCampaign[ 0x4 ];		// 0x03AC (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyCritterStartSizeMultiplierCampaign[ 0x4 ];		// 0x03BC (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyCritterGrowthRateMultiplierCampaign[ 0x4 ];		// 0x03CC (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyAIStartResourcesMultiplierCampaign[ 0x4 ];		// 0x03DC (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyAICreatureGrowthRateMultiplierCampaign[ 0x4 ];		// 0x03EC (0x0010) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDifficultyAIResourceIncomeMultiplierCampaign[ 0x4 ];		// 0x03FC (0x0010) [0x0000000000000001]              ( CPF_Edit )
	int                                                mQuickCombatMapWidth;                             		// 0x040C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mQuickCombatMoraleLuckInitBonusFactor;            		// 0x0410 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mQuickCombatMovementFactor;                       		// 0x0414 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mQuickCombatHeroDamageFactor;                     		// 0x0418 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mQuickCombatAttackDefenseMightMagicFactor;        		// 0x041C (0x0004) [0x0000000000000001]              ( CPF_Edit )
