#pragma once 

/*
#############################################################################################
# Might and Magic Heroes 7 (1.0.8364.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51 x64
# ========================================================================================= #
# File: MMH7Game_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct MMH7Game.GenerateRMGDataCommandlet.GenerateRMGDataCompilationTask
// 0x00000018
struct FGenerateRMGDataCompilationTask
{
//	 vPoperty_Size=3
	class UObject*                                     mTargetShaderCache;                               		// 0x0000 (0x0008) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	class UMaterialInstanceConstant*                   mTargetMat;                                       		// 0x0008 (0x0008) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	struct FPointer                                    mStaticParameterSet;                              		// 0x0010 (0x0008) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.NecromancyEffectRatePair
// 0x0000000C
struct FNecromancyEffectRatePair
{
//	 vPoperty_Size=2
	class UH7EffectSpecialNecromancy*                  Effect;                                           		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              Rate;                                             		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.CreatureLossPair
// 0x0000000C
struct FCreatureLossPair
{
//	 vPoperty_Size=2
	class AH7Creature*                                 Creature;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                Losses;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.AiActionScore
// 0x00000028
struct FAiActionScore
{
//	 vPoperty_Size=5
	float                                              Score;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	class UH7AiActionBase*                             Action;                                           		// 0x0004 (0x0008) [0x0000000000000000]              
	class UH7AiActionParam*                            Params;                                           		// 0x000C (0x0008) [0x0000000000000000]              
	struct FString                                     dbgString;                                        		// 0x0014 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              Tension;                                          		// 0x0024 (0x0004) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7SoundSettings
// 0x00000004
struct FH7SoundSettings
{
//	 vPoperty_Size=4
	unsigned long                                      EnableAmbientChannel : 1;                         		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      EnableMusicChannel : 1;                           		// 0x0000 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      EnableSoundChannel : 1;                           		// 0x0000 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      EnableVoiceChannel : 1;                           		// 0x0000 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.PathCostAoCArray
// 0x00000020
struct FPathCostAoCArray
{
//	 vPoperty_Size=2
	TArray< float >                                    Costs;                                            		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UH7AdventureLayerCellProperty* >     Terrains;                                         		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7AiSpellEvaluation
// 0x0000001C
struct FH7AiSpellEvaluation
{
//	 vPoperty_Size=3
	float                                              Damage;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	class UH7IEffectTargetable*                        Target;                                           		// 0x0004 (0x0010) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x000C (0x0008) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class UH7HeroAbility*                              Spell;                                            		// 0x0014 (0x0008) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7PathfinderArrayContainer
// 0x00000010
struct FH7PathfinderArrayContainer
{
//	 vPoperty_Size=1
	TArray< class UH7CombatMapCell* >                  CellsReachableInXTurns;                           		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7AiCombatInstructionEvaluation
// 0x0000003D
struct FH7AiCombatInstructionEvaluation
{
//	 vPoperty_Size=a
	class AH7CreatureStack*                            Subordinate;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	class AH7CreatureStack*                            Target;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
	float                                              DamagePotentialReduction;                         		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                TurnsToReach;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                KillCount;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                SubordinateIniQueuePosition;                      		// 0x001C (0x0004) [0x0000000000000000]              
	unsigned long                                      TargetActsAfterSubordinate : 1;                   		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	class UH7CombatMapCell*                            HitCell;                                          		// 0x0024 (0x0008) [0x0000000000000000]              
	TArray< class UH7CombatMapCell* >                  Path;                                             		// 0x002C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      AttackDir;                                        		// 0x003C (0x0001) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7AiCombatInstruction
// 0x0000004C
struct FH7AiCombatInstruction
{
//	 vPoperty_Size=3
	unsigned char                                      InstructionType;                                  		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FH7AiCombatInstructionEvaluation            Evaluation;                                       		// 0x0004 (0x0040) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class AH7CreatureStack*                            InstructionOwner;                                 		// 0x0044 (0x0008) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7AiObjectivePair
// 0x00000011
struct FH7AiObjectivePair
{
//	 vPoperty_Size=3
	class AH7AdventureArmy*                            Subordinate;                                      		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class AH7EditorMapObject*                          Target;                                           		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ActionType;                                       		// 0x0010 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7ClassSkillWeight
// 0x0000000C
struct FH7ClassSkillWeight
{
//	 vPoperty_Size=2
	class UH7Skill*                                    mSkill;                                           		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                mWeight;                                          		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7AiActionParameter
// 0x00000018
struct FH7AiActionParameter
{
//	 vPoperty_Size=6
	float                                              General;                                          		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Main;                                             		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Secondary;                                        		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Scout;                                            		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Support;                                          		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Mule;                                             		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7ClassSkillWeightRef
// 0x00000014
struct FH7ClassSkillWeightRef
{
//	 vPoperty_Size=2
	struct FString                                     mSkillRef;                                        		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                mWeight;                                          		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7RuneAbilityReplacement
// 0x00000010
struct FH7RuneAbilityReplacement
{
//	 vPoperty_Size=2
	class UH7RuneAbility*                              mRuneAbility;                                     		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UH7BaseAbility*                              mBaseAbility;                                     		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7AbandonedMineResource
// 0x00000018
struct FH7AbandonedMineResource
{
//	 vPoperty_Size=4
	class UH7Resource*                                 Type;                                             		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UStaticMesh*                                 MeshOverride;                                     		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                Income;                                           		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      Enabled : 1;                                      		// 0x0014 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7RunicBoxReward
// 0x00000004
struct FH7RunicBoxReward
{
//	 vPoperty_Size=1
	int                                                Dummy;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7CreatureReward
// 0x0025(0x0029 - 0x0004)
struct FH7CreatureReward : FH7RunicBoxReward
{
//	 vPoperty_Size=7
	int                                                Amount;                                           		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AH7Creature*                                 Type;                                             		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UH7Faction* >                        PermittedFactions;                                		// 0x0010 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned char                                      MinLevel;                                         		// 0x0020 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      MaxLevel;                                         		// 0x0021 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	int                                                Strength;                                         		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      UpgradeType;                                      		// 0x0028 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7TearOfAshaReward
// 0x00000014
struct FH7TearOfAshaReward
{
//	 vPoperty_Size=2
	int                                                ItemCount;                                        		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UH7HeroItem* >                       ItemRewards;                                      		// 0x0004 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7ArtifactReward
// 0x0020(0x0024 - 0x0004)
struct FH7ArtifactReward : FH7RunicBoxReward
{
//	 vPoperty_Size=4
	class UH7HeroItem*                                 Type;                                             		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                Amount;                                           		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RandomType;                                       		// 0x0010 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UH7HeroItem* >                       Types;                                            		// 0x0014 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7ExperienceReward
// 0x0004(0x0008 - 0x0004)
struct FH7ExperienceReward : FH7RunicBoxReward
{
//	 vPoperty_Size=1
	int                                                Amount;                                           		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7ResourceReward
// 0x000C(0x0010 - 0x0004)
struct FH7ResourceReward : FH7RunicBoxReward
{
//	 vPoperty_Size=2
	int                                                Amount;                                           		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UH7Resource*                                 Type;                                             		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7ManaReward
// 0x0004(0x0008 - 0x0004)
struct FH7ManaReward : FH7RunicBoxReward
{
//	 vPoperty_Size=1
	int                                                Amount;                                           		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7AttributeReward
// 0x0005(0x0009 - 0x0004)
struct FH7AttributeReward : FH7RunicBoxReward
{
//	 vPoperty_Size=2
	int                                                Amount;                                           		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Type;                                             		// 0x0008 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7TerrainCostModifier
// 0x00000018
struct FH7TerrainCostModifier
{
//	 vPoperty_Size=4
	struct FName                                       TileTypeName;                                     		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UH7PathList*                                 TileTypeNames;                                    		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      OperationType;                                    		// 0x0010 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	float                                              Modifier;                                         		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7RunicForgeItem
// 0x00000010
struct FH7RunicForgeItem
{
//	 vPoperty_Size=2
	class UH7ItemSet*                                  ItemSet;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	class UH7HeroItem*                                 Artifact;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7DwellingCreatureData
// 0x00000015
struct FH7DwellingCreatureData
{
//	 vPoperty_Size=5
	class AH7Creature*                                 Creature;                                         		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                Income;                                           		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Reserve;                                          		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Capacity;                                         		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      CreatureTier;                                     		// 0x0014 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7TownDwellingOverride
// 0x00000060
struct FH7TownDwellingOverride
{
//	 vPoperty_Size=7
	class AH7Town*                                     TargetTown;                                       		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UH7TownDwelling*                             TargetDwelling;                                   		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FH7DwellingCreatureData                     CreaturePool;                                     		// 0x0010 (0x0018) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     Name;                                             		// 0x0028 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     Description;                                      		// 0x0038 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     IconPath;                                         		// 0x0048 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UTexture2D*                                  Icon;                                             		// 0x0058 (0x0008) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7BooleanStruct
// 0x00000004
struct FH7BooleanStruct
{
//	 vPoperty_Size=1
	unsigned long                                      Allowed : 1;                                      		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.RandomLordDefenseData
// 0x00000055
struct FRandomLordDefenseData
{
//	 vPoperty_Size=11
	unsigned long                                      mUseThis : 1;                                     		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	int                                                mMinStackNumber;                                  		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mMaxStackNumber;                                  		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UH7Faction* >                        mAllowedFactions;                                 		// 0x000C (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned char                                      mFactionType;                                     		// 0x001C (0x0001) [0x0000000000000001]              ( CPF_Edit )
	class AH7AreaOfControlSiteLord*                    mReferenceLord;                                   		// 0x0020 (0x0008) [0x0000000000000000]              
	unsigned long                                      mUseFactionOfLord : 1;                            		// 0x0028 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mUseCreatureLevel : 1;                            		// 0x0028 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	struct FH7BooleanStruct                            mAllowedLevels[ 0x5 ];                            		// 0x002C (0x0014) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mUseXPStrength : 1;                               		// 0x0040 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	int                                                mXPStrength;                                      		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mMinStackSize;                                    		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mMaxStackSize;                                    		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mChooseRandomCreatures : 1;                       		// 0x0050 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mChooseSameFaction : 1;                           		// 0x0050 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mLimitLevelsFromXP : 1;                           		// 0x0050 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned char                                      mCreatureUpgrades;                                		// 0x0054 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7RawCampaignData
// 0x00000084
struct FH7RawCampaignData
{
//	 vPoperty_Size=9
	int                                                mRevision;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     mName;                                            		// 0x0004 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     mFileName;                                        		// 0x0014 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     mAuthor;                                          		// 0x0024 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     mDescription;                                     		// 0x0034 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           mCampaignMaps;                                    		// 0x0044 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           mCampaignMapNames;                                		// 0x0054 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           mCampaignMapInfoNumbers;                          		// 0x0064 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     mContainerObjectName;                             		// 0x0074 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.BaseMapProgress
// 0x00000028
struct FBaseMapProgress
{
//	 vPoperty_Size=7
	struct FString                                     MapFilename;                                      		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                StartTimesCount;                                  		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              GameplayTimeSec;                                  		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                TotalGameplayTimeMin;                             		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                StartTimesUntilCompleted;                         		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                TurnsUntilCompleted;                              		// 0x0020 (0x0004) [0x0000000000000000]              
	unsigned long                                      WasOnceCompleted : 1;                             		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7DifficultyParameters
// 0x00000004
struct FH7DifficultyParameters
{
//	 vPoperty_Size=4
	unsigned char                                      mStartResources;                                  		// 0x0000 (0x0001) [0x0000000000000000]              
	unsigned char                                      mCritterStartSize;                                		// 0x0001 (0x0001) [0x0000000000000000]              
	unsigned char                                      mCritterGrowthRate;                               		// 0x0002 (0x0001) [0x0000000000000000]              
	unsigned char                                      mAiEcoStrength;                                   		// 0x0003 (0x0001) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7MapSaveMapping
// 0x00000038
struct FH7MapSaveMapping
{
//	 vPoperty_Size=5
	int                                                mSaveSlotIndex;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                mSaveTimeUnix;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FString                                     mMapFileName;                                     		// 0x0008 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     mCampaignID;                                      		// 0x0018 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     mSaveFileName;                                    		// 0x0028 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.CampaignMapProgress
// 0x0058(0x0080 - 0x0028)
struct FCampaignMapProgress : FBaseMapProgress
{
//	 vPoperty_Size=6
	TArray< int >                                      UnlockedStorypoints;                              		// 0x0028 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      CurrentMapState;                                  		// 0x0038 (0x0001) [0x0000000000000000]              
	int                                                MapIndexInCampaign;                               		// 0x003C (0x0004) [0x0000000000000000]              
	struct FH7DifficultyParameters                     HighestDifficulty;                                		// 0x0040 (0x0004) [0x0000000000000000]              
	struct FH7DifficultyParameters                     CurrentDifficulty;                                		// 0x0044 (0x0004) [0x0000000000000000]              
	struct FH7MapSaveMapping                           LastMapSave;                                      		// 0x0048 (0x0038) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.CampaignProgress
// 0x000001E8
struct FCampaignProgress
{
//	 vPoperty_Size=d
	int                                                CampaignProgressIndex;                            		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FH7RawCampaignData                          RawCampaignData;                                  		// 0x0004 (0x0084) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UH7CampaignDefinition*                       CampaignRef;                                      		// 0x0088 (0x0008) [0x0000000000000000]              
	unsigned long                                      IsCompleted : 1;                                  		// 0x0090 (0x0004) [0x0000000000000000] [0x00000001] 
	TArray< struct FCampaignMapProgress >              CompletedMaps;                                    		// 0x0094 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FCampaignMapProgress                        CurrentMap;                                       		// 0x00A4 (0x0080) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FCampaignMapProgress                        ReplayMap;                                        		// 0x0124 (0x0080) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              GameplayTimeSec;                                  		// 0x01A4 (0x0004) [0x0000000000000000]              
	int                                                TotalGameplayTimeMin;                             		// 0x01A8 (0x0004) [0x0000000000000000]              
	unsigned long                                      CouncilIntroPlayed : 1;                           		// 0x01AC (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      CouncilOutroPlayed : 1;                           		// 0x01AC (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      ProgressScenePlayed : 1;                          		// 0x01AC (0x0004) [0x0000000000000000] [0x00000004] 
	struct FH7MapSaveMapping                           LastCampaignSave;                                 		// 0x01B0 (0x0038) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7GuardCreatureData
// 0x00000008
struct FH7GuardCreatureData
{
//	 vPoperty_Size=2
	unsigned char                                      mCreatureTier;                                    		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	int                                                mAmount;                                          		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7TownGuardModifier
// 0x00000009
struct FH7TownGuardModifier
{
//	 vPoperty_Size=3
	unsigned char                                      mOperation;                                       		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	int                                                mValue;                                           		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      mTier;                                            		// 0x0008 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7GroupedMeshes
// 0x00000020
struct FH7GroupedMeshes
{
//	 vPoperty_Size=2
	struct FString                                     Group;                                            		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class UStaticMesh* >                       Meshes;                                           		// 0x0010 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7TooltipModifierInfo
// 0x00000024
struct FH7TooltipModifierInfo
{
//	 vPoperty_Size=3
	int                                                Value;                                            		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     Category;                                         		// 0x0004 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     Source;                                           		// 0x0014 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7UPlayAction
// 0x00000048
struct FH7UPlayAction
{
//	 vPoperty_Size=7
	struct FString                                     idUtf8;                                           		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     nameUtf8;                                         		// 0x0010 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     descriptionUtf8;                                  		// 0x0020 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     imageUrlUtf8;                                     		// 0x0030 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                units;                                            		// 0x0040 (0x0004) [0x0000000000000000]              
	unsigned long                                      completed : 1;                                    		// 0x0044 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      synchronized : 1;                                 		// 0x0044 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7UPlayReward
// 0x00000078
struct FH7UPlayReward
{
//	 vPoperty_Size=a
	struct FString                                     idUtf8;                                           		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     nameUtf8;                                         		// 0x0010 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     descriptionUtf8;                                  		// 0x0020 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     urlUtf8;                                          		// 0x0030 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                units;                                            		// 0x0040 (0x0004) [0x0000000000000000]              
	struct FString                                     gameCodeUtf8;                                     		// 0x0044 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     platformCodeUtf8;                                 		// 0x0054 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     imageUrlUtf8;                                     		// 0x0064 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	unsigned long                                      redeemed : 1;                                     		// 0x0074 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      Enabled : 1;                                      		// 0x0074 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7DwellingCreatureDataArray
// 0x00000010
struct FH7DwellingCreatureDataArray
{
//	 vPoperty_Size=1
	TArray< struct FH7DwellingCreatureData >           Datas;                                            		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.MovieData
// 0x00000018
struct FMovieData
{
//	 vPoperty_Size=3
	struct FString                                     MovieName;                                        		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      WasSkipped : 1;                                   		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              PlayTime;                                         		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7LobbyDataMapSettings
// 0x00000020
struct FH7LobbyDataMapSettings
{
//	 vPoperty_Size=7
	struct FString                                     mMapFileName;                                     		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	unsigned char                                      mVictoryCondition;                                		// 0x0010 (0x0001) [0x0000000000000000]              
	unsigned long                                      mCanUseStartBonus : 1;                            		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      mTeamSetup;                                       		// 0x0018 (0x0001) [0x0000000000000000]              
	unsigned long                                      mUseRandomStartPosition : 1;                      		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      mUseDefaults : 1;                                 		// 0x001C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      mIsRandomMapPreviewAvailable : 1;                 		// 0x001C (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7SpellScaling
// 0x00000014
struct FH7SpellScaling
{
//	 vPoperty_Size=5
	unsigned long                                      mUseCap : 1;                                      		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	int                                                mMinCap;                                          		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mMaxCap;                                          		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mSlope;                                           		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mIntercept;                                       		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7LevelScalingRange
// 0x0000000C
struct FH7LevelScalingRange
{
//	 vPoperty_Size=3
	int                                                mMin;                                             		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                mMax;                                             		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mAmount;                                          		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7ResourceQuantity
// 0x00000018
struct FH7ResourceQuantity
{
//	 vPoperty_Size=5
	class UH7Resource*                                 Type;                                             		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                Quantity;                                         		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                RandomQuantityMin;                                		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                RandomQuantityMax;                                		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                RandomQuantityMultiplier;                         		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7PurchaseAbleStatModCosts
// 0x0000002C
struct FH7PurchaseAbleStatModCosts
{
//	 vPoperty_Size=3
	unsigned long                                      mUseLevelScalingCosts : 1;                        		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	struct FH7ResourceQuantity                         mCosts;                                           		// 0x0004 (0x0018) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FH7LevelScalingRange >              mLevelRanges;                                     		// 0x001C (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7MeModifiesStat
// 0x00000070
struct FH7MeModifiesStat
{
//	 vPoperty_Size=1a
	unsigned char                                      mStat;                                            		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      mCombineOperation;                                		// 0x0001 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	float                                              mModifierValue;                                   		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mShowFloatingText : 1;                            		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mUseSpellScaling : 1;                             		// 0x0008 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mUseLevelScaling : 1;                             		// 0x0008 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned char                                      mLevelOperation;                                  		// 0x000C (0x0001) [0x0000000000000001]              ( CPF_Edit )
	float                                              mLevelScalingMultiplier;                          		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mUseBattleRageValue : 1;                          		// 0x0014 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mMultiplyWithBattleRage : 1;                      		// 0x0014 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mUseMetamagicValue : 1;                           		// 0x0014 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      mMultiplyWithMetamagic : 1;                       		// 0x0014 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      mUseRunePowerValue : 1;                           		// 0x0014 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      mMultiplyWithRunePower : 1;                       		// 0x0014 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	struct FH7SpellScaling                             mScalingModifierValue;                            		// 0x0018 (0x0014) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FH7LevelScalingRange >              mStatModLevelScalingValue;                        		// 0x002C (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FH7PurchaseAbleStatModCosts >       mStatModCosts;                                    		// 0x003C (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      mMultiplyWithPathLength : 1;                      		// 0x004C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mShirneSeventhDragon : 1;                         		// 0x004C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mOverrideWithAnotherStat : 1;                     		// 0x004C (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned char                                      mStatToOverrideWith;                              		// 0x0050 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mModifyStatForCreature : 1;                       		// 0x0054 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	class AH7Creature*                                 mModifyThatCreature;                              		// 0x0058 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mModifyCreatureVersions : 1;                      		// 0x0060 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	class UH7EffectContainer*                          mSource;                                          		// 0x0064 (0x0008) [0x0000000000000000]              
	float                                              mInitialModValue;                                 		// 0x006C (0x0004) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.ConditionalStatMod
// 0x00000088
struct FConditionalStatMod
{
//	 vPoperty_Size=3
	struct FH7MeModifiesStat                           StatMod;                                          		// 0x0000 (0x0070) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UH7EffectContainer*                          Source;                                           		// 0x0070 (0x0008) [0x0000000000000000]              
	class UH7IEffectTargetable*                        Target;                                           		// 0x0078 (0x0010) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x0080 (0x0008) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.RecruitHeroData
// 0x00000014
struct FRecruitHeroData
{
//	 vPoperty_Size=5
	int                                                RandomHeroesIndex;                                		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Cost;                                             		// 0x0004 (0x0004) [0x0000000000000000]              
	class AH7AdventureArmy*                            Army;                                             		// 0x0008 (0x0008) [0x0000000000000000]              
	unsigned long                                      IsNew : 1;                                        		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      IsAvailable : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.TownHeroesPoolData
// 0x00000018
struct FTownHeroesPoolData
{
//	 vPoperty_Size=2
	class AH7Town*                                     TownOwner;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	TArray< struct FRecruitHeroData >                  HeroesPool;                                       		// 0x0008 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7PlayerProperties
// 0x00000009
struct FH7PlayerProperties
{
//	 vPoperty_Size=2
	class AH7Player*                                   mPlayer;                                          		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      mTeam;                                            		// 0x0008 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.AiReceptivityEntry
// 0x00000020
struct FAiReceptivityEntry
{
//	 vPoperty_Size=8
	float                                              statHitpoints;                                    		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              statInitiative;                                   		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              statAttack;                                       		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              statDefense;                                      		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              statLeadership;                                   		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              statDestiny;                                      		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              statDamage;                                       		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              statMovement;                                     		// 0x001C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.AiReceptivityTable
// 0x00000080
struct FAiReceptivityTable
{
//	 vPoperty_Size=4
	struct FAiReceptivityEntry                         recEntryFighter;                                  		// 0x0000 (0x0020) [0x0000000000000001]              ( CPF_Edit )
	struct FAiReceptivityEntry                         recEntryRogue;                                    		// 0x0020 (0x0020) [0x0000000000000001]              ( CPF_Edit )
	struct FAiReceptivityEntry                         recEntryShooter;                                  		// 0x0040 (0x0020) [0x0000000000000001]              ( CPF_Edit )
	struct FAiReceptivityEntry                         recEntryMage;                                     		// 0x0060 (0x0020) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.PlayerHeroesPoolData
// 0x00000018
struct FPlayerHeroesPoolData
{
//	 vPoperty_Size=2
	class AH7Player*                                   PlayerOwner;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	TArray< struct FRecruitHeroData >                  HeroesPool;                                       		// 0x0008 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.ResourceStockpile
// 0x00000010
struct FResourceStockpile
{
//	 vPoperty_Size=3
	class UH7Resource*                                 Type;                                             		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                Quantity;                                         		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Income;                                           		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.RandomHeroData
// 0x0000000C
struct FRandomHeroData
{
//	 vPoperty_Size=2
	class AH7EditorHero*                               HeroArchetype;                                    		// 0x0000 (0x0008) [0x0000000000000000]              
	unsigned long                                      IsBeingUsed : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7MinePlunderCounter
// 0x0000000D
struct FH7MinePlunderCounter
{
//	 vPoperty_Size=3
	class AH7Mine*                                     Mine;                                             		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                Counter;                                          		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PlayerID;                                         		// 0x000C (0x0001) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7AbilityTrackingData
// 0x00000038
struct FH7AbilityTrackingData
{
//	 vPoperty_Size=5
	struct FString                                     AbilityName;                                      		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     CasterName;                                       		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                NumberOfCasts;                                    		// 0x0020 (0x0004) [0x0000000000000000]              
	struct FString                                     CasterPlayerFaction;                              		// 0x0024 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                CasterPlayerPosition;                             		// 0x0034 (0x0004) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7LevelUpData
// 0x0000000C
struct FH7LevelUpData
{
//	 vPoperty_Size=3
	int                                                Level;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      Stat;                                             		// 0x0004 (0x0001) [0x0000000000000000]              
	int                                                Value;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7CaravanRoute
// 0x00000010
struct FH7CaravanRoute
{
//	 vPoperty_Size=2
	class AH7AreaOfControlSiteLord*                    sourceLord;                                       		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class AH7AreaOfControlSiteLord*                    targetLord;                                       		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7TownBuffToAoCData
// 0x00000018
struct FH7TownBuffToAoCData
{
//	 vPoperty_Size=3
	class UH7TownBuilding*                             mBuilding;                                        		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UH7BaseBuff*                                 mBuff;                                            		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class AH7Creature*                                 mCreature;                                        		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7SiteVisitData
// 0x00000009
struct FH7SiteVisitData
{
//	 vPoperty_Size=2
	class AH7VisitableSite*                            Site;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	unsigned char                                      PlayerID;                                         		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7TownBuildingVisitData
// 0x00000011
struct FH7TownBuildingVisitData
{
//	 vPoperty_Size=3
	class UH7TownBuilding*                             Building;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	class AH7Town*                                     Town;                                             		// 0x0008 (0x0008) [0x0000000000000000]              
	unsigned char                                      PlayerID;                                         		// 0x0010 (0x0001) [0x0000000000000000]              
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7RewardData
// 0x00000010
struct FH7RewardData
{
//	 vPoperty_Size=4
	class UH7HeroItem*                                 Item;                                             		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ItemTier;                                         		// 0x0008 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ItemType;                                         		// 0x0009 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      UniqueOffering : 1;                               		// 0x000C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7MultiRewardData
// 0x00000010
struct FH7MultiRewardData
{
//	 vPoperty_Size=1
	TArray< struct FH7RewardData >                     RewardData;                                       		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct MMH7Game.H7StructsAndEnumsNative.H7CreatureArray
// 0x00000010
